vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7029.h
// I2C BUS PERIPHERAL DEVICE 0

#define          I2CBASE                                    (*(volatile unsigned long      *) 0xFFFF0800)
#define          I2CMSTA                                    (*(volatile unsigned long      *) 0xFFFF0800)
#define          I2CSSTA                                    (*(volatile unsigned long      *) 0xFFFF0804)
#define          I2CSRX                                     (*(volatile unsigned long      *) 0xFFFF0808)
#define          I2CSTX                                     (*(volatile unsigned long      *) 0xFFFF080C)
#define          I2CMRX                                     (*(volatile unsigned long      *) 0xFFFF0810)
#define          I2CMTX                                     (*(volatile unsigned long      *) 0xFFFF0814)
#define          I2CCNT                                     (*(volatile unsigned long      *) 0xFFFF0818)
#define          I2CADR                                     (*(volatile unsigned long      *) 0xFFFF081C)
#define          I2CBYTE                                    (*(volatile unsigned long      *) 0xFFFF0824)
#define          I2CALT                                     (*(volatile unsigned long      *) 0xFFFF0828)
#define          I2CCFG                                     (*(volatile unsigned long      *) 0xFFFF082C)
#define          I2CDIV                                     (*(volatile unsigned long      *) 0xFFFF0830)
#define          I2CID0                                     (*(volatile unsigned long      *) 0xFFFF0838)
#define          I2CID1                                     (*(volatile unsigned long      *) 0xFFFF083C)
#define          I2CID2                                     (*(volatile unsigned long      *) 0xFFFF0840)
#define          I2CID3                                     (*(volatile unsigned long      *) 0xFFFF0844)
#define          I2CCCNT                                    (*(volatile unsigned long      *) 0xFFFF0848)
#define          I2CFSTA                                    (*(volatile unsigned long      *) 0xFFFF084C)

// I2C BUS PERIPHERAL DEVICE 0

#define          I2C0BASE                                   (*(volatile unsigned long      *) 0xFFFF0800)
#define          I2C0MSTA                                   (*(volatile unsigned long      *) 0xFFFF0800)
#define          I2C0SSTA                                   (*(volatile unsigned long      *) 0xFFFF0804)
#define          I2C0SRX                                    (*(volatile unsigned long      *) 0xFFFF0808)
#define          I2C0STX                                    (*(volatile unsigned long      *) 0xFFFF080C)
#define          I2C0MRX                                    (*(volatile unsigned long      *) 0xFFFF0810)
#define          I2C0MTX                                    (*(volatile unsigned long      *) 0xFFFF0814)
#define          I2C0CNT                                    (*(volatile unsigned long      *) 0xFFFF0818)
#define          I2C0ADR                                    (*(volatile unsigned long      *) 0xFFFF081C)
#define          I2C0BYTE                                   (*(volatile unsigned long      *) 0xFFFF0824)
#define          I2C0ALT                                    (*(volatile unsigned long      *) 0xFFFF0828)
#define          I2C0CFG                                    (*(volatile unsigned long      *) 0xFFFF082C)
#define          I2C0DIV                                    (*(volatile unsigned long      *) 0xFFFF0830)
#define          I2C0ID0                                    (*(volatile unsigned long      *) 0xFFFF0838)
#define          I2C0ID1                                    (*(volatile unsigned long      *) 0xFFFF083C)
#define          I2C0ID2                                    (*(volatile unsigned long      *) 0xFFFF0840)
#define          I2C0ID3                                    (*(volatile unsigned long      *) 0xFFFF0844)
#define          I2C0CCNT                                   (*(volatile unsigned long      *) 0xFFFF0848)
#define          I2C0FSTA                                   (*(volatile unsigned long      *) 0xFFFF084C)

// I2C BUS PERIPHERAL DEVICE 1

#define          I2C1BASE                                   (*(volatile unsigned long      *) 0xFFFF0900)
#define          I2C1MSTA                                   (*(volatile unsigned long      *) 0xFFFF0900)
#define          I2C1SSTA                                   (*(volatile unsigned long      *) 0xFFFF0904)
#define          I2C1SRX                                    (*(volatile unsigned long      *) 0xFFFF0908)
#define          I2C1STX                                    (*(volatile unsigned long      *) 0xFFFF090C)
#define          I2C1MRX                                    (*(volatile unsigned long      *) 0xFFFF0910)
#define          I2C1MTX                                    (*(volatile unsigned long      *) 0xFFFF0914)
#define          I2C1CNT                                    (*(volatile unsigned long      *) 0xFFFF0918)
#define          I2C1ADR                                    (*(volatile unsigned long      *) 0xFFFF091C)
#define          I2C1BYTE                                   (*(volatile unsigned long      *) 0xFFFF0924)
#define          I2C1ALT                                    (*(volatile unsigned long      *) 0xFFFF0928)
#define          I2C1CFG                                    (*(volatile unsigned long      *) 0xFFFF092C)
#define          I2C1DIV                                    (*(volatile unsigned long      *) 0xFFFF0930)
#define          I2C1ID0                                    (*(volatile unsigned long      *) 0xFFFF0938)
#define          I2C1ID1                                    (*(volatile unsigned long      *) 0xFFFF093C)
#define          I2C1ID2                                    (*(volatile unsigned long      *) 0xFFFF0940)
#define          I2C1ID3                                    (*(volatile unsigned long      *) 0xFFFF0944)
#define          I2C1CCNT                                   (*(volatile unsigned long      *) 0xFFFF0948)
#define          I2C1FSTA                                   (*(volatile unsigned long      *) 0xFFFF094C)

// SERIAL PORT INTERFACE PERIPHERAL

#define          SPIBASE                                    (*(volatile unsigned long      *) 0xFFFF0A00)
#define          SPISTA                                     (*(volatile unsigned long      *) 0xFFFF0A00)
#define          SPIRX                                      (*(volatile unsigned long      *) 0xFFFF0A04)
#define          SPITX                                      (*(volatile unsigned long      *) 0xFFFF0A08)
#define          SPIDIV                                     (*(volatile unsigned long      *) 0xFFFF0A0C)
#define          SPICON                                     (*(volatile unsigned long      *) 0xFFFF0A10)

// PROGRAMABLE LOGIC ARRAY

#define          PLABASE                                    (*(volatile unsigned long      *) 0xFFFF0B00)
#define          PLAELM0                                    (*(volatile unsigned long      *) 0xFFFF0B00)
#define          PLAELM1                                    (*(volatile unsigned long      *) 0xFFFF0B04)
#define          PLAELM2                                    (*(volatile unsigned long      *) 0xFFFF0B08)
#define          PLAELM3                                    (*(volatile unsigned long      *) 0xFFFF0B0C)
#define          PLAELM4                                    (*(volatile unsigned long      *) 0xFFFF0B10)
#define          PLAELM5                                    (*(volatile unsigned long      *) 0xFFFF0B14)
#define          PLAELM6                                    (*(volatile unsigned long      *) 0xFFFF0B18)
#define          PLAELM7                                    (*(volatile unsigned long      *) 0xFFFF0B1C)
#define          PLAELM8                                    (*(volatile unsigned long      *) 0xFFFF0B20)
#define          PLAELM9                                    (*(volatile unsigned long      *) 0xFFFF0B24)
#define          PLAELM10                                   (*(volatile unsigned long      *) 0xFFFF0B28)
#define          PLAELM11                                   (*(volatile unsigned long      *) 0xFFFF0B2C)
#define          PLAELM12                                   (*(volatile unsigned long      *) 0xFFFF0B30)
#define          PLAELM13                                   (*(volatile unsigned long      *) 0xFFFF0B34)
#define          PLAELM14                                   (*(volatile unsigned long      *) 0xFFFF0B38)
#define          PLAELM15                                   (*(volatile unsigned long      *) 0xFFFF0B3C)
#define          PLACLK                                     (*(volatile unsigned long      *) 0xFFFF0B40)
#define          PLAIRQ                                     (*(volatile unsigned long      *) 0xFFFF0B44)
#define          PLAADC                                     (*(volatile unsigned long      *) 0xFFFF0B48)
#define          PLADIN                                     (*(volatile unsigned long      *) 0xFFFF0B4C)
#define          PLADOUT                                    (*(volatile unsigned long      *) 0xFFFF0B50)
#define          PLALCK                                     (*(volatile unsigned long      *) 0xFFFF0B54)
#if           ALLOW_DEPRECATED_NAMES        
// "PLADLCK" has been deprecated. Use "PLALCK" instead.
#define          PLADLCK                                    (*(volatile unsigned long      *) 0xFFFF0B54)
#endif

// GPIO AND SERIAL PORT MUX

#define          GPIOBASE                                   (*(volatile unsigned long      *) 0xFFFFF400)
#define          GP0CON                                     (*(volatile unsigned long      *) 0xFFFFF400)
#define          GP1CON                                     (*(volatile unsigned long      *) 0xFFFFF404)
#define          GP2CON                                     (*(volatile unsigned long      *) 0xFFFFF408)
#define          GP3CON                                     (*(volatile unsigned long      *) 0xFFFFF40C)
#define          GP4CON                                     (*(volatile unsigned long      *) 0xFFFFF410)
#define          GP0DAT                                     (*(volatile unsigned long      *) 0xFFFFF420)
#define          GP0SET                                     (*(volatile unsigned long      *) 0xFFFFF424)
#define          GP0CLR                                     (*(volatile unsigned long      *) 0xFFFFF428)
#define          GP0PAR                                     (*(volatile unsigned long      *) 0xFFFFF42C)
#define          GP1DAT                                     (*(volatile unsigned long      *) 0xFFFFF430)
#define          GP1SET                                     (*(volatile unsigned long      *) 0xFFFFF434)
#define          GP1CLR                                     (*(volatile unsigned long      *) 0xFFFFF438)
#define          GP1PAR                                     (*(volatile unsigned long      *) 0xFFFFF43C)
#define          GP2DAT                                     (*(volatile unsigned long      *) 0xFFFFF440)
#define          GP2SET                                     (*(volatile unsigned long      *) 0xFFFFF444)
#define          GP2CLR                                     (*(volatile unsigned long      *) 0xFFFFF448)
#define          GP3DAT                                     (*(volatile unsigned long      *) 0xFFFFF450)
#define          GP3SET                                     (*(volatile unsigned long      *) 0xFFFFF454)
#define          GP3CLR                                     (*(volatile unsigned long      *) 0xFFFFF458)
#define          GP4DAT                                     (*(volatile unsigned long      *) 0xFFFFF460)
#define          GP4SET                                     (*(volatile unsigned long      *) 0xFFFFF464)
#define          GP4CLR                                     (*(volatile unsigned long      *) 0xFFFFF468)

// FLASH CONTROL INTERFACE

#define          FLASHBASE                                  (*(volatile unsigned long      *) 0xFFFFF800)
#define          FEESTA                                     (*(volatile unsigned long      *) 0xFFFFF800)
#define          FEEMOD                                     (*(volatile unsigned long      *) 0xFFFFF804)
#define          FEECON                                     (*(volatile unsigned long      *) 0xFFFFF808)
#define          FEEDAT                                     (*(volatile unsigned long      *) 0xFFFFF80C)
#define          FEEADR                                     (*(volatile unsigned long      *) 0xFFFFF810)
#define          FEESIGN                                    (*(volatile unsigned long      *) 0xFFFFF818)
#define          FEEPRO                                     (*(volatile unsigned long      *) 0xFFFFF81C)
#define          FEEHIDE                                    (*(volatile unsigned long      *) 0xFFFFF820)

// PWM

