vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7029.h
#define          PWMBASE                                    (*(volatile unsigned long      *) 0xFFFFFC00)
#define          PWMCON                                     (*(volatile unsigned long      *) 0xFFFFFC00)
#define          PWMSTA                                     (*(volatile unsigned long      *) 0xFFFFFC04)
#if           ALLOW_DEPRECATED_NAMES        
// "PWMSTA0" has been deprecated. Use "PWMSTA" instead.
#define          PWMSTA0                                    (*(volatile unsigned long      *) 0xFFFFFC04)
#endif
#define          PWMDAT0                                    (*(volatile unsigned long      *) 0xFFFFFC08)
#define          PWMDAT1                                    (*(volatile unsigned long      *) 0xFFFFFC0C)
#define          PWMCFG                                     (*(volatile unsigned long      *) 0xFFFFFC10)
#define          PWMCH0                                     (*(volatile unsigned long      *) 0xFFFFFC14)
#define          PWMCH1                                     (*(volatile unsigned long      *) 0xFFFFFC18)
#define          PWMCH2                                     (*(volatile unsigned long      *) 0xFFFFFC1C)
#define          PWMEN                                      (*(volatile unsigned long      *) 0xFFFFFC20)
#define          PWMDAT2                                    (*(volatile unsigned long      *) 0xFFFFFC24)
/*    Function Pointers for Interrupts  */
typedef void (* tyVctHndlr) (void);

extern tyVctHndlr    IRQ;
extern tyVctHndlr    SWI;
extern tyVctHndlr    FIQ;
extern tyVctHndlr    UNDEF;
extern tyVctHndlr    PABORT;
extern tyVctHndlr    DABORT;
